# Rebar Termination Orientation Enumeration

Source: https://www.revitapidocs.com/2026/0fa2b2c9-7655-e132-8b84-064a3e13fcd3.htm

---

| Rebar Termination Orientation Enumeration |
| --- |

Orientation of a rebar termination (e.g hook, crank) relative to the path of the Rebar Shape.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum RebarTerminationOrientation
```

```
Public Enumeration RebarTerminationOrientation
```

```
public enum class RebarTerminationOrientation
```

```
type RebarTerminationOrientation
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| Left | 1 | Hook or crank towards the left of a segment\-based shape (RebarShapeDefinitionBySegments), or to the  interior of an arc\-based shape (RebarShapeDefinitionByArc). |
| Right | \-1 | Hook or crank towards the right of a segment\-based shape (RebarShapeDefinitionBySegments), or to the  exterior of an arc\-based shape (RebarShapeDefinitionByArc). |

See Also

#### Reference

Autodesk.Revit.DB.Structure Namespace